app/views/recipients/index.html.erb

<%= @recipients.each do |r| %>
    <li><%= link_to "#{r.name}", recipient_path(r.id) %> || <%= "#{r.gifts.all}"%></li>
---
SELECT "gifts".* FROM "gifts" WHERE "gifts"."recipient_id" = ?  [["recipient_id", 1]]