app/views/recipients/new.html.erb

  <div>
    <%= f.collection_select :gift_ids, Gift.all, :id, :name %>
---
SELECT "gifts".* FROM "gifts"