app/views/recipients/show.html.erb

<ul>
<% @recipient.gifts.each do |gift| %>
---
SELECT "gifts".* FROM "gifts" WHERE "gifts"."recipient_id" = ?  [["recipient_id", 1]]