app/views/gifts/new.html.erb

  <div>
    <%= f.collection_select :recipient_id, Recipient.all, :id, :name %>
---
SELECT "recipients".* FROM "recipients"