app/controllers/gifts_controller.rb

    def create
        @gift = Gift.new(gift_params)
        @gift.giver_id = session[:giver_id]
        @gift.recipient_id = params[:gift][:recipient_id]
        if @gift.save
---
INSERT INTO "gifts" ("giver_id", "recipient_id", "name", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["giver_id", 4], ["recipient_id", 3], ["name", "cat ear headband"], ["created_at", "2021-08-21 23:57:22.660278"], ["updated_at", "2021-08-21 23:57:22.660278"]]

    def index
        @gifts = Gift.all
---
SELECT "gifts".* FROM "gifts"

    def show
        @gift = Gift.find_by_id(params[:id])
---
SELECT "gifts".* FROM "gifts" WHERE "gifts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]