app/controllers/givers_controller.rb

INSERT INTO "givers" ("name", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
    def create
        @giver = Giver.new(giver_params)
        if @giver.save

SELECT "givers".* FROM "givers" WHERE "givers"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
    def show
        @giver = Giver.find_by_id(params[:id])