app/controllers/recipients_controller.rb

INSERT INTO "recipients" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Robin"], ["created_at", "2021-08-21 19:30:21.264071"], ["updated_at", "2021-08-21 19:30:21.264071"]]
---
    def create
        @recipient = Recipient.new(recipient_params)
        #@recipient.giver_id = session[:giver_id]
        if @recipient.save

SELECT "recipients".* FROM "recipients" ORDER BY "recipients"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
    def index
        @recipients = Recipient.all

SELECT "recipients".* FROM "recipients" WHERE "recipients"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
    def show
        @recipient = Recipient.find_by_id(params[:id])

SELECT "recipients".* FROM "recipients" WHERE "recipients"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def edit
        @recipient = Recipient.find_by_id(params[:id])