app/controllers/sessions_controller.rb

    def create
        @giver = Giver.find_by(email: params[:giver][:email])
---
SELECT "givers".* FROM "givers" WHERE "givers"."email" = ? LIMIT ?  [["email", "garfield@garfield.com"], ["LIMIT", 1]]